# Дан список. Реализовать сдвиг на 1 элемент влево.
tur_l = [1, 2, 3, 4, 5, 6, 7, 8]
print(tur_l)
tur_l.insert(8, 1)
tur_l.remove(1)
print(tur_l)